---
kind: property
id: P:Autodesk.Revit.DB.Panel.Lockable
zh: 面板
source: html/de2fe971-bfa0-342a-494c-ac81ea37b571.htm
---
# Autodesk.Revit.DB.Panel.Lockable Property

**中文**: 面板

This property is used to know whether a panel can be locked.

## Syntax (C#)
```csharp
public bool Lockable { get; }
```

## Remarks
If the panel can be locked, return true, else false.